// 1. 배경

// 2. ESM의 기능

// 3. ESM의 구성

// 4. ESM의 도입효과

// 5. ESM의 발전방향



// 출처: https://ensxoddl.tistory.com/193 [지금 이 순간]

//   - 급속도로 발달하기 시작한 정보기술(IT)은 개인이나 기업의 자산 관리를 편리하게 만들었지만 그에 따른 보안 위협도 증가함.

//   - 방화벽을 필두로 침입탐지시스템(IDS), 가상사설망(VPN), 침입방지시스템(IPS) 등 많은 보안시스템이 등장

//   - 다양한 보안시스템의 등장으로 이들 단위 보안시스템에 대한 중앙집중적인 통합 관리의 필요성이 대두되고 있는 상황

//   - 이때 등장한 솔루션이 통합보안관리(ESM; Enterprise Security Management) 시스템

//   - 즉, ESM(Enterprise Security Managment)은 기업과 기관의 보안정책을 반영, 다양한 보안시스템을 관제ㆍ운영ㆍ관리함으로써 조직의 보안목적을 효율적으로 실현시키는 시스템

 

// 2. ESM의 기능

//   - 기업이 보유하고 있는 각종 보안제품(방화벽, IPS, VPN) 및 네트워크 장비(서버, 라우터 등)를 상호 연동하여 효율적으로 운영할수 있도록 지원

//   - 다양한 위협에 대한 사전, 사후 대응을 가능하게 함

//   - 기업 IT자산에 대한 가용성, 무결성, 기밀성 보장을 위한 위험관리를 수행
//   - 이벤트 선별 기능, 통합 실시간 모니터링 기능, 보고서 생성 기능을 수행

 

// 3. ESM의 구성

//   - 에이전트 : 방화벽이나 침입방지시스템, 게이트웨이, 라우터 등의 장비에서 정보를 수집하여 실시간으로 수집 서버에 전송하는 시스템
//   - 수집서버 : 각 장비에 탑재되어 있는 에이전트를 통하여 들어온 정보들을 수집 및 정리하여 데이터베이스 서버 및 분석 서버에 전송하는 시스템
//   - 데이터베이스서버 : 수집 서버에서 정리된 정보를 데이터베이스에 저장하는 시스템
//   - 분석 서버 : 수집 서버에서 들어온 데이터 및 데이터베이스에 저장된 정보를 바탕으로 현 네트워크의 상태 및 위기 상황을 분석하고 정리하여 그 결과를 사용자에게 알려주고 현상 및 경과 등의 정보를 데이터 베이스에 다시 저장하는 시스템



// http://111plmkoinjhiu.zoa138.net/m/1799041

// 4. ESM의 도입효과

//  - 이벤트 수집ㆍ통합관리ㆍ침해경보ㆍ침해대응 등의 통합보안관리체계 확립

//  - 보안관리업무를 보다 신속하고 체계적인 프로세스에 의거하여 효율적으로 진행

//  - 모니터링 및 보고서 업무 등 단순반복성 업무를 상당 부분 줄여 줘 보안관리자가 보안기획 및 정책 수립에 집중할 수 있도록 해 보안업무의 질적 향상을 기대

 

// 5. ESM의 발전방향

//   - ESM은 진정한 의미의 통합보안관리를 수행하기 위해 더 넓은 영역으로 확장
//   - 기존에 보안시스템에 국한되었던 관제대상을 일반 PC에까지 확장하여 보안관리에 의한 보안 사각지대의 최소화

//   - ESM은 실제적인 `위협` 수준이 아니라 잠재적인 `위험` 수준에서 관리가 이루어지는 위험관리시스템(RMS; Risk Management System) 수준으로 개발

//   - 모든 보안 프로세스를 단일한 시스템에 포함시켜 수집-모니터링-분석-경보-대응-처리-보고-정책 피드백 등 일련의 프로세스를 지원



// 출처: https://ensxoddl.tistory.com/193 [지금 이 순간]